# Function

## addi : add imidiate 
  
  คือ เป็นการบวก โดยกรณีนี้นำ 32 + x0 โดย x0 จะเป็น 0 เสมอ แล้วนำผลลัพธ์มาเก็บไว้ที่ x1
  
## lui : load upper imidiate

  คือ นำค่าด้านขวาสุด 1 word หรือ 32 bite(0xc0000000) มาใส่ใน x2 (ใส่แค่ 20 บิต ทางซ้าย)
  
## lbu : load bite unsigned

  คือ การนำเลขหน่วยความจำที่ x1 (0x1) มาใส่ใน x3
  
## beq : branch on equal

  คือ เป็นการเช็คว่าเท่ากันหรือไม่ ถ้าเท่ากันจะกระโดดไปที่ branch กรณีนี้ถ้า x3=0 จะบวกไป 16 (กระโดดไปที่ address 24)
  
## sb : store bite

  คือ เก็บในหน่วยความจำ เป็นการนำข้อมูลที่ x3 ไปเก็บที่  address x2
  
## jal : jump and link

  คือ เป็นการกระโดดข้ามไปที่ address
